Repository: common-repository/browser-check
Catalog: i18n/browser-check-*.po
Languages: ru_ru

source: Basic
ru_ru: Основной

source: Minimal
ru_ru: Минимальный

source: None
ru_ru: Без стилей

source: Settings
ru_ru: Настройки

source: Browser check
ru_ru: Проверка браузера

source: Browsers
ru_ru: Браузеры

source: Other
ru_ru: Прочее

source: Display
ru_ru: Отображение

source: Style
ru_ru: Стиль

source: Hide cancellation button
ru_ru: Скрыть кнопку отмены

source: Time of cancellation
ru_ru: Время отмены

source: Time between checks
ru_ru: Время между проверками

source: For these browsers, specify the minimum required version. Leave field blank if the browser does not have to be checked.
ru_ru: Для следующих браузеров укажите минимальную необходимую версию. Оставьте поле пустым, если браузер не должен проходить проверку.

source: Other checks user's browser.
ru_ru: Прочие виды проверок браузера пользователя.

source: Settings display messages.
ru_ru: Настройки отображения сообщения о результате проверки браузера.

source: JavaScript is required to check Cookie.
ru_ru: Для проверки Cookie необходим JavaScript.

source: Specify a minimum required version of Flash Player. Leave field blank if check is not needed. JavaScript is required for check.
ru_ru: Укажите минимальную необходимую версию Flash Player. Оставьте поле пустым, если проверка не нужна. Для проверки необходим JavaScript.

source: The basic set of CSS. It includes styles for different screen sizes.
ru_ru: Основной набор CSS. Включает стили для различных размеров экрана.

source: The minimum set of CSS. Select if you want to write most styles.
ru_ru: Минимальный набор CSS. Выберите, если хотите написать большую часть стилей.

source: CSS does not apply. Select if you want to write a styles completely.
ru_ru: CSS не применяется. Выберите, если хотите написать стили полностью.

source: Minutes
ru_ru: Минуты

source: User can hide the message on check of browser for this time. Not recommended leave field empty or equal to 0, if hide cancellation button checkbox not selected. Because then the message will be closed for the session. Duration of session depends on settings of browser.
ru_ru: Пользователь может скрыть сообщение о проверке браузера на это время. Если не выбран пункт скрыть кнопку отмены, то не рекомендуется оставлять поле пустым или равным 0. Иначе сообщение будет скрыто на время сессии, а продолжительность сессии зависит от настроек браузера пользователя.

source: Days
ru_ru: Дни

source: Successful check hide the message on check of browser for this time. Not recommended leave field empty or equal to 0. Because then the message will be closed for the session. Duration of session depends on settings of browser.
ru_ru: Успешная проверка браузера скрывает сообщение на это время. Не рекомендуется оставлять поле пустым или равным 0. Иначе сообщение будет скрыто на время сессии, а продолжительность сессии зависит от настроек браузера пользователя.

source: Your browser %s version %s outdated. The site may not work properly. Update your browser or download and install the new one:
ru_ru: Ваш браузер %s версии %s устарел. Сайт может работать неккоректно. Обновите ваш браузер либо скачайте и установите новый:

source: Continue browsing the site
ru_ru: Продолжить просмотр сайта

source: Cookie are disabled in your browser. Cookie are required for the site work. Please enable Cookie in your browser.
ru_ru: В вашем браузере отключены Cookie. Для работы сайта Cookie необходимы. Включите Cookie в настройках вашего браузера.

source: Your Flash Player version %s outdated. To work site requires Flash Player did not lower than version %s.
ru_ru: Ваш Flash Player версии %s устарел. Для работы сайта требуется Flash Player не ниже %s версии.

source: Update your Flash Player.
ru_ru: Обновите Flash Player.

source: To work site requires Flash Player.
ru_ru: Для работы сайта требуется Flash Player.

source: Install Flash Player.
ru_ru: Установите Flash Player.

source: JavaScript are disabled in your browser. JavaScript are required for the site work. Please enable JavaScript in your browser.
ru_ru: В вашем браузере отключен JavaScript. Для работы сайта JavaScript необходим. Включите JavaScript в настройках вашего браузера.

source: Check user's browser for compliance with the specified requirements. User will be warned by a message if check fails.
ru_ru: Проверка браузера пользователя на соответствие указаннным требованиям. Пользователь будет предупрежден сообщением, если браузер не пройдет проверку.

source: Browser Check
ru_ru: Проверка браузера

source: Check browser version, JavaScript, Cookie, Adobe Flash Player.
ru_ru: Проверка версии браузера, JavaScript, Cookie, версии Adobe Flash Player.

source: Yaroslav Klochikhin
ru_ru: Ярослав Клочихин
